In [2]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists 
connection_str = "mysql+pymysql://root:root@localhost/demo_db"

In [3]:
# Create the engine 
# To make the connection between Python and MySQL, you will create an engine using the connection string you just defined 
engine = create_engine(connection_str)

# Create a New Database
- First, check to see if a database with the name you are using already exists

In [4]:
database_exists(connection_str)

False

If it does not exist already, we will now create it. If the database with that name already exists, you need to choose a different name.

In [5]:
create_database(connection_str)

In [6]:
# Check if the database exists. If not, create it.
#if database_exists(connection_str) == False:
  #create_database(connection_str)
#else:
  #print('The database already exists')

# Making a data frame a table in a MySQL database

In [8]:
import pandas as pd
df = pd.read_csv('Raw Data/Tshirt.csv')
df.head()

   ItemId Size  Color  Cost Sold
0       1    S   Blue  5.00    Y
1       2    M    Red  7.49    Y
2       3    M  Green  8.00    N
3       4   XL  Green  4.00    N
4       5    L    Red  9.99    Y

To make this dataframe into a table in our database, we need to create a dictionary with each column and its SQLAlchemy datatype 

First we will import the data types from SQLAlchemy

In [9]:
from sqlalchemy.types import *

For text and string columns, we will include the number of characters along with the datatype. We can determine how many characters is appropriate by finding the maximum length of our existing data or by considering the possible entries for a column.

In [11]:
# Calculate max string lengths for object columns 
size_length = df['Size'].fillna('').map(len).max()
size_length

2

The maximum length for Size is XL with only two characters. If we want to allow for XXL or other sizes with more than 2 characters, we will need to consider this when setting our datatype/

In [12]:
# Calculate the max string lengths for object columns 
color_length = df['Color'].fillna('').map(len).max()
color_length

5

Now we create the dictionary for each column with its corresponding data type.

In [16]:
# Create a schema dictionar using SQLAlchemy datatype objects 
dtypes_dict = {'ItemId': INTEGER(), 
              'Size': VARCHAR(5),
              'Color': VARCHAR(10),
              'Cost': FLOAT(),
              'Sold' : CHAR(1)}

In [17]:
# Create a connection to the database so we can add the table using the connection 
conn = engine.connect()

In [18]:
# save to sql with dtypes and index = False 
df.to_sql('tshirts', conn, dtype = dtypes_dict, if_exists = 'replace', index = False)

9

Now that we have converted this dataframe to a SQL table, we can 'communicate' with it using SQL commands. 

We can also define the primary key for this table using ALTER TABLE and ADD PRIMARY KEY. The primary key for this table will be the ItemId column. Use backticks around `ItemId`. 

Do not use pd.read_sql since it gives an error because the SQL command does not return anything (it just makes ItemId the primary key)

To run this quey without an error, we can use the connection itself to execute the query

In [19]:
# Add a primary key 
q = '''
ALTER TABLE tshirts ADD PRIMARY KEY (`ItemId`);
'''
conn.execute(q)

A good query to run after creating a table is DESCRIBE table as it will show the datatypes as well as the Primary Key once it is defined.

In [20]:
# Describe table
q = ''' DESCRIBE tshirts''' 
pd.read_sql(q, conn)

    Field         Type Null  Key Default Extra
0  ItemId          int   NO  PRI    None
1    Size   varchar(5)  YES         None
2   Color  varchar(10)  YES         None
3    Cost        float  YES         None
4    Sold      char(1)  YES         None

In [21]:
# Show tables
q = ''' SHOW TABLES;''' 
pd.read_sql(q, conn)

  Tables_in_demo_db
0           tshirts

# DELETE and DROP

In [22]:
# Drop one row by using DELETE FROM and using a WHERE condition of ItemId = 3 
## Since this will not return anything, we will use conn.execute()
q = ''' DELETE FROM tshirts WHERE ItemId = 3;'''
conn.execute(q)

In [23]:
# Confirm the deletion through a query 
q = ''' SELECT * FROM tshirts LIMIT 3;'''
pd.read_sql(q, conn)

   ItemId Size  Color  Cost Sold
0       1    S   Blue  5.00    Y
1       2    M    Red  7.49    Y
2       4   XL  Green  4.00    N

In [24]:
# Deleting all data from a table (DELETE)
## The table will still exist with the columns and datatypes intact 
q = ''' DELETE FROM tshirts;''' 
conn.execute(q)

In [25]:
# Confirm the deletion through a query 
q = """SELECT * FROM tshirts LIMIT 3;"""
pd.read_sql(q,conn)

Empty DataFrame
Columns: [ItemId, Size, Color, Cost, Sold]
Index: []

In [26]:
# Dropping a table and its schema (DROP TABLE)
## Using DROP TABLE will completely eliminate all the data, column names, data types- the table will be completely destroyed
q = ''' DROP TABLE tshirts;'''
conn.execute(q)

In [27]:
# Check that the table has been deleted
q = ''' SHOW TABLES;'''
pd.read_sql(q, conn)

Empty DataFrame
Columns: [Tables_in_demo_db]
Index: []

In [28]:
# When you are finished working in a database, you should close the connection 
conn.close()